[
  {
    "id": 1,
    "title": "Graph RAG Chatbot",
    "category": "AI",
    "image": "/KG.png",
    "summary": "A hybrid Knowledge-Graph RAG system combining Neo4j and ChromaDB to deliver highly contextual semantic retrieval, powered by Azure OpenAI and LangChain for intelligent, domain-aware Q&A.",
    "description": "A Knowledge-Graph RAG Platform engineered with LangChain and Neo4j to deliver structured semantic retrieval. It integrates ChromaDB vector embeddings with Azure OpenAI GPT models to enable contextual Q&A and insight generation. The system features secure OAuth2/JWT-based API access and a CI/CD deployment pipeline through GitLab for internal environments. Through hybrid graph–vector optimization, the platform boosts retrieval accuracy by over 60%, ensuring faster, richer, and domain-aware responses.",
    "tech": [
      "FastAPI",
      "Python",
      "LangChain",
      "Neo4j",
      "ChromaDB",
      "OpenAI",
      "OAUTH2/JWT"
    ],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/Knowledge-Graph-RAG-Chatbot"
    }
  },
  {
    "id": 2,
    "title": "Candidate Assessment Tool",
    "category": "BACKEND",
    "image": "/Candi.png",
    "summary": "A workflow-driven candidate evaluation system built with Java, Spring Boot, and MySQL, featuring an MVC-based architecture, automated assessment flows, and optimized data access using Spring Data JPA.",
    "description": "Candidate Assessment Tool is a workflow-driven evaluation platform built with Java, Spring Boot, JSP, and MySQL. It features an MVC-based layered architecture, automated assessment pipelines that streamline HR decision-making, and optimized data operations powered by Spring Data JPA. Designed for efficiency and reliability, the system significantly reduces manual effort while improving end-to-end evaluation speed.",
    "tech": [
      "Java",
      "Spring Boot",
      "Spring MVC",
      "Spring Data JPA",
      "JSP",
      "MySQL"
    ],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/Candidate-Assesment-Tool"
    }
  },
  {
    "id": 3,
    "title": "BLACK SPOT DETECTION",
    "category": "WEB",
    "image": "/black.png",
    "summary": "A real-time accident-prone zone monitoring platform designed to enhance public safety using geospatial analytics.",
    "description": "Black Spot Detection is a web-based safety intelligence system built to help authorities identify and monitor high-risk accident zones. The platform integrates Google Maps API for real-time geospatial visualization, enables continuous monitoring of critical locations, and improves emergency response workflows. With optimized data handling using JDBC and MySQL, the system delivers faster processing and reliable analytics, resulting in measurable improvements in public safety awareness and response efficiency.",
    "tech": ["Java", "JDBC", "Servlets", "JSP", "MySQL", "Google Maps API"],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/BLACKSPOT"
    }
  },
  {
    "id": 4,
    "title": "Zerodha Clone",
    "category": "Web",
    "image": "/zeroda.png",
    "summary": "A full-stack trading and investment platform clone inspired by Zerodha, featuring real-time market data and seamless trade execution simulation.",
    "description": "The Zerodha Clone is a web-based trading application designed to replicate the core experience of modern brokerage platforms. It includes live market data streaming, interactive candlestick and line charts, secure user authentication, and a virtual portfolio for executing mock trades. The system offers intuitive dashboards for tracking holdings, orders, and P&L insights. Built with optimized APIs and a modular frontend architecture, the platform provides a smooth, responsive, and high-fidelity trading experience.",
    "tech": ["React", "Redux", "Node.js", "Express", "WebSockets", "MongoDB"],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/Zerodha-Mern-App"
    }
  },
  {
    "id": 5,
    "title": "Visionary",
    "category": "ML",
    "image": "/image.png",
    "summary": "A real-time defect detection system powered by deep learning, built for high-precision manufacturing quality control.",
    "description": "Visionary is an edge-optimized ML application that uses advanced computer vision models to detect defects in production lines with 99.9% accuracy. It processes live video feeds in real time, enabling manufacturers to identify anomalies instantly and reduce production errors. Designed for low-latency inference on edge devices, the system significantly improves output quality, operational efficiency, and automated quality assurance workflows.",
    "tech": ["Python", "TensorFlow", "OpenCV", "AZURE", "FastAPI"],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/SMB-Financial-Management-Tool"
    }
  },
  {
    "id": 6,
    "title": "WanderLust",
    "category": "Web",
    "image": "/wanderlust.png",
    "summary": "A travel discovery and itinerary-planning platform designed to help users explore destinations with personalized recommendations.",
    "description": "WanderLust is a modern travel exploration website that allows users to discover destinations, plan trips, and curate itineraries with ease. The platform features guided search filters, interactive destination cards, and a personalized recommendation engine. Users can bookmark locations, view travel guides, and build shareable itineraries. With a visually rich UI and responsive layouts, WanderLust offers an immersive and intuitive travel planning experience.",
    "tech": ["React", "Node.js", "Express", "MongoDB", "Tailwind CSS"],
    "links": {
      "live": "#",
      "repo": "https://github.com/Chetan7378/wanderlust_chetan"
    }
  }
]
